neon-smart-studio/W-Link_NeonRTOS_Platform/src/Drivers/soc/MSPM0/driverlib/dl_i2s.h
/** @enum DL_I2S_WCLK_PHASE */
typedef enum {
    /*! Calculate WCLK division ratio for single phase operation */
    DL_I2S_WCLK_PHASE_SINGLE = (0U << I2S_CLKCTL_WCLKPHASE_OFS),
    /*! Calculate WCLK division ratio for dual phase operation */
    DL_I2S_WCLK_PHASE_DUAL = (1U << I2S_CLKCTL_WCLKPHASE_OFS),
    /*! Calculate user-defined custom WCLK division ratio */
    DL_I2S_WCLK_PHASE_CUSTOM = (2U << I2S_CLKCTL_WCLKPHASE_OFS),
} DL_I2S_WCLK_PHASE;

/** @enum DL_I2S_MODE */
typedef enum {
    /*! I2S controller mode. Module outputs audio clock signals (WCLK, BCLK) */
    DL_I2S_MODE_CONTROLLER = 0U,
    /*! I2S target mode. Audio clock signals are inputs (WCLK, BCLK) */
    DL_I2S_MODE_TARGET = 1U,
} DL_I2S_MODE;

/** @enum DL_I2S_DATA_PIN_DIRECTION */
typedef enum {
    /*! Data pin not in use (disabled) */
    DL_I2S_DATA_PIN_DIRECTION_UNUSED = 0U,
    /*! Data pin acts as input */
    DL_I2S_DATA_PIN_DIRECTION_INPUT = 1U,
    /*! Data pin acts as output */
    DL_I2S_DATA_PIN_DIRECTION_OUTPUT = 2U,
} DL_I2S_DATA_PIN_DIRECTION;

/** @enum DL_I2S_TX_FIFO_LEVEL */
typedef enum {
    /*! Trigger when the TX FIFO <= 3/4 empty */
    DL_I2S_TX_FIFO_LEVEL_3_4_EMPTY = I2S_IFLS_TXIFLSEL_LVL_3_4,
    /*! Trigger when TX FIFO <= 1/2 empty (default) */
    DL_I2S_TX_FIFO_LEVEL_1_2_EMPTY = I2S_IFLS_TXIFLSEL_LVL_1_2,
    /*! Trigger when TX FIFO <= 1/4 empty */
    DL_I2S_TX_FIFO_LEVEL_1_4_EMPTY = I2S_IFLS_TXIFLSEL_LVL_1_4,
    /*! Trigger when TX FIFO is empty */
    DL_I2S_TX_FIFO_LEVEL_EMPTY = I2S_IFLS_TXIFLSEL_LVL_EMPTY,
    /*! Trigger when TX FIFO <= 1 */
    DL_I2S_TX_FIFO_LEVEL_ONE_ENTRY = I2S_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY,
    /*! Trigger when TX FIFO >= (MAX_FIFO_LEN - 1) */
    DL_I2S_TX_FIFO_LEVEL_ALMOST_FULL = I2S_IFLS_TXIFLSEL_LVL_ALMOST_FULL,
} DL_I2S_TX_FIFO_LEVEL;

/** @enum DL_I2S_RX_FIFO_LEVEL */
typedef enum {
    /*! Trigger when RX FIFO >= 1/4 full */
    DL_I2S_RX_FIFO_LEVEL_1_4_FULL = I2S_IFLS_RXIFLSEL_LVL_1_4,
    /*! Trigger when RX FIFO >= 1/2 full (default) */
    DL_I2S_RX_FIFO_LEVEL_1_2_FULL = I2S_IFLS_RXIFLSEL_LVL_1_2,
    /*! Trigger when RX FIFO >= 3/4 full */
    DL_I2S_RX_FIFO_LEVEL_3_4_FULL = I2S_IFLS_RXIFLSEL_LVL_3_4,
    /*! Trigger when RX FIFO is full */
    DL_I2S_RX_FIFO_LEVEL_FULL = I2S_IFLS_RXIFLSEL_LVL_FULL,
    /*! Trigger when RX FIFO >= (MAX_FIFO_LEN - 1) */
    DL_I2S_RX_FIFO_LEVEL_ALMOST_FULL = I2S_IFLS_RXIFLSEL_LVL_ALMOST_FULL,
    /*! Trigger when RX FIFO <= 1 */
    DL_I2S_RX_FIFO_LEVEL_ONE_ENTRY = I2S_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY,
} DL_I2S_RX_FIFO_LEVEL;

/*! @enum DL_I2S_IIDX */
typedef enum {
    /*! Interrupt index for I2S if no interrupt is pending */
    DL_I2S_IIDX_NO_INT = I2S_IIDX_STAT_NO_INTR,
    /*! Interrupt index for I2S WCLK Error */
    DL_I2S_IIDX_WCLK_ERR = I2S_IIDX_STAT_WCLKERR,
    /*! Interrupt index for I2S Receive Interrupt */
    DL_I2S_IIDX_RX_DONE = I2S_IIDX_STAT_RXIFG,
    /*! Interrupt index for I2S Transmit Interrupt */
    DL_I2S_IIDX_TX_DONE = I2S_IIDX_STAT_TXIFG,
    /*! Interrupt index for I2S RXFIFO Overflow Event */
    DL_I2S_IIDX_RXFIFO_OVERFLOW = I2S_IIDX_STAT_RXFIFO_OVF_EVT,
    /*! Interrupt index for I2S TXFIFO Underflow Event */
    DL_I2S_IIDX_TXFIFO_UNDERFLOW = I2S_IIDX_STAT_TXFIFO_UNF_EVT,
    /*! Interrupt index for DMA Done on RX */
    DL_I2S_IIDX_DMA_DONE_RX = I2S_IIDX_STAT_DMA_DONE_RX,
    /*! Interrupt index for DMA Done on TX */
    DL_I2S_IIDX_DMA_DONE_TX = I2S_IIDX_STAT_DMA_DONE_TX,
} DL_I2S_IIDX;

/**
 * @brief  Configuration struct for @ref DL_I2S_setClockConfig.
 */
typedef struct {
    /*! I2S clock source. One of @ref DL_I2S_CLOCK_SOURCE */
    DL_I2S_CLOCK_SOURCE clockSel;
    /*! Audio clocks (WCLK, BCLK) source. One of @ref DL_I2S_WORD_BAUD_CLOCK_SOURCE */
    DL_I2S_WORD_BAUD_CLOCK_SOURCE wordBaudClockSource;
    /*! WCLK phase. One of @ref DL_I2S_WCLK_PHASE */
    DL_I2S_WCLK_PHASE wclkPhase;
    /*! WCLK divide ratio. [0x1, 0xFFFF] */
    uint32_t wclkDivider;
    /*! BCLK divide ratio. [ @ref DL_I2S_BDIV_MINIMUM, @ref DL_I2S_BDIV_MAXIMUM] */
    uint32_t bclkDivider;
} DL_I2S_ClockConfig;

/**
 * @brief  Configuration struct for @ref DL_I2S_init.
 */
typedef struct {
    /*! Controller or target mode. One of @ref DL_I2S_MODE */
    DL_I2S_MODE mode;
    /*! WCLK inversion. One of @ref DL_I2S_WCLK_INVERSION */
    DL_I2S_WCLK_INVERSION wclkInvert;
    /*! Single or dual-phase. One of @ref DL_I2S_PHASE */
    DL_I2S_PHASE phase;
    /*! Positive or negative sampling edge. One of @ref DL_I2S_SAMPLE_EDGE */
    DL_I2S_SAMPLE_EDGE samplingEdge;
    /*! Number of bits per sample word. [7, 31]. See @ref DL_I2S_setSampleWordLength */
    uint32_t sampleWordLength;
    /*! Data delay. One of @ref DL_I2S_DATA_DELAY */
    DL_I2S_DATA_DELAY dataDelay;
    /*! Empty slot output. One of @ref DL_I2S_EMPTY_SLOT_OUTPUT */
    DL_I2S_EMPTY_SLOT_OUTPUT emptySlotOutput;
    /*! Memory access length. One of @ref DL_I2S_MEMORY_LENGTH */
    DL_I2S_MEMORY_LENGTH memoryAccessLength;
    /*! Data pin 0 (AD0) direction. One of @ref DL_I2S_DATA_PIN_DIRECTION */
    DL_I2S_DATA_PIN_DIRECTION dataPin0Direction;
    /*! Valid channel mask for a frame on a data pin. [0, 0xFF] */
    uint32_t dataPin0ValidChannelMask;
#ifdef DEVICE_HAS_MULTIPLE_DATA_PIN
    /*! Data pin 1 (AD1) direction. One of @ref DL_I2S_DATA_PIN_DIRECTION */
    DL_I2S_DATA_PIN_DIRECTION dataPin1Direction;
    /*! Valid channel mask for a frame on a data pin. [0, 0xFF] */
    uint32_t dataPin1ValidChannelMask;
#endif
    /*! MCLK divide ratio. [ @ref DL_I2S_MDIV_MINIMUM, @ref DL_I2S_MDIV_MAXIMUM] */
    uint32_t mclkDivider;
    /*! Enable the optional MCLK signal. Controller mode only */
    bool enableMCLK;
} DL_I2S_Config;

/**
 *  @brief      Configure I2S audio clocks (WCLK and BCLK)
 *
 *  @param[in]  i2s     Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  config  Pointer to the clock configuration struct
 *                      @ref DL_I2S_ClockConfig.
 */
void DL_I2S_setClockConfig(I2S_Regs *i2s, const DL_I2S_ClockConfig *config);

/**
 *  @brief      Get I2S audio clocks configuration (WCLK and BCLK)
 *
 *  @param[in]  i2s     Pointer to the register overlay for the
 *                      peripheral
 *  @param[out] config  Pointer to the clock configuration struct
 *                      @ref DL_I2S_ClockConfig.
 */
void DL_I2S_getClockConfig(const I2S_Regs *i2s, DL_I2S_ClockConfig *config);

/**
 *  @brief     Initialize the I2S peripheral
 *
 *  Initializes all the common configurable options for the I2S peripheral. Any
 *  other custom configuration can be done after calling this API. The I2S is
 *  not enabled in this API.
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *  @param[in]  config  Configuration for I2S peripheral
 */
void DL_I2S_init(I2S_Regs *i2s, const DL_I2S_Config *config);

/**
 *  @brief      Writes 8-bit data into the TX FIFO for transmit
 *
 *  Puts the data into the TX FIFO without checking its status. Use if already
 *  sure the TX FIFO has space for the write. See related APIs for additional
 *  transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 8 bits.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @sa         DL_I2S_transmitDataBlocking8
 *  @sa         DL_I2S_transmitDataCheck8
 */
__STATIC_INLINE void DL_I2S_transmitData8(I2S_Regs *i2s, uint8_t data)
{
    i2s->TXDATA = data;
}

/**
 *  @brief      Writes 16-bit data into the TX FIFO for transmit
 *
 *  Puts the data into the TX FIFO without checking its status. Use if already
 *  sure the TX FIFO has space for the write. See related APIs for additional
 *  transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 16 bits.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @sa         DL_I2S_transmitDataBlocking16
 *  @sa         DL_I2S_transmitDataCheck16
 */
__STATIC_INLINE void DL_I2S_transmitData16(I2S_Regs *i2s, uint16_t data)
{
    i2s->TXDATA = data;
}

/**
 *  @brief      Writes 32-bit data into the TX FIFO for transmit
 *
 *  Puts the data into the TX FIFO without checking its status. Use if already
 *  sure the TX FIFO has space for the write. See related APIs for additional
 *  transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 32 bits.
 *
 *  NOTE: A 32-bit write will be written as one FIFO entry. The application can
 *  choose to pack two 16-bit frames into one word.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @sa         DL_I2S_transmitDataBlocking32
 *  @sa         DL_I2S_transmitDataCheck32
 */
__STATIC_INLINE void DL_I2S_transmitData32(I2S_Regs *i2s, uint32_t data)
{
    i2s->TXDATA = data;
}

/**
 *  @brief      Reads 8-bit data from the RX FIFO
 *
 *  Reads the data from the RX FIFO without checking its status. Use if
 *  already sure the RX FIFO has data available. See related APIs for
 *  additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 8 bits.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @sa         DL_I2S_receiveDataBlocking8
 *  @sa         DL_I2S_receiveDataCheck8
 */
__STATIC_INLINE uint8_t DL_I2S_receiveData8(const I2S_Regs *i2s)
{
    return ((uint8_t)(i2s->RXDATA));
}

/**
 *  @brief      Reads 16-bit data from the RX FIFO
 *
 *  Reads the data from the RX FIFO without checking its status. Use if
 *  already sure the RX FIFO has data available. See related APIs for
 *  additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 16 bits.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @sa         DL_I2S_receiveDataBlocking16
 *  @sa         DL_I2S_receiveDataCheck16
 */
__STATIC_INLINE uint16_t DL_I2S_receiveData16(const I2S_Regs *i2s)
{
    return ((uint16_t)(i2s->RXDATA));
}

/**
 *  @brief      Reads 32-bit data from the RX FIFO
 *
 *  Reads the data from the RX FIFO without checking its status. Use if
 *  already sure the RX FIFO has data available. See related APIs for
 *  additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 32 bits.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @sa         DL_I2S_receiveDataBlocking32
 *  @sa         DL_I2S_receiveDataCheck32
 */
__STATIC_INLINE uint32_t DL_I2S_receiveData32(const I2S_Regs *i2s)
{
    return (i2s->RXDATA);
}

/**
 *  @brief      Blocks to ensure transmit is ready before sending data
 *
 *  Puts the data into the TX FIFO after blocking to ensure the TX FIFO is not
 *  full. Will wait indefinitely until there is space in the TX FIFO. See
 *  related APIs for additional transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 8 bits.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @sa         DL_I2S_transmitData8
 *  @sa         DL_I2S_transmitDataCheck8
 */
void DL_I2S_transmitDataBlocking8(I2S_Regs *i2s, uint8_t data);

/**
 *  @brief      Blocks to ensure transmit is ready before sending data
 *
 *  Puts the data into the TX FIFO after blocking to ensure the TX FIFO is not
 *  full. Will wait indefinitely until there is space in the TX FIFO. See
 *  related APIs for additional transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 16 bits.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @sa         DL_I2S_transmitData16
 *  @sa         DL_I2S_transmitDataCheck16
 */
void DL_I2S_transmitDataBlocking16(I2S_Regs *i2s, uint16_t data);

/**
 *  @brief      Blocks to ensure transmit is ready before sending data
 *
 *  Puts the data into the TX FIFO after blocking to ensure the TX FIFO is not
 *  full. Will wait indefinitely until there is space in the TX FIFO. See
 *  related APIs for additional transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 32 bits.
 *
 *  NOTE: A 32-bit write will be written as one FIFO entry. The application can
 *  choose to pack two 16-bit frames into one word.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @sa         DL_I2S_transmitData32
 *  @sa         DL_I2S_transmitDataCheck32
 */
void DL_I2S_transmitDataBlocking32(I2S_Regs *i2s, uint32_t data);

/**
 *  @brief      Blocks to ensure receive is ready before reading data
 *
 *  Reads the data from the RX FIFO after blocking to ensure the RX FIFO is not
 *  empty. Will wait indefinitely until there is data in the RX FIFO. See
 *  related APIs for additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 8 bits.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @sa         DL_I2S_receiveData16
 *  @sa         DL_I2S_receiveDataCheck16
 */
uint8_t DL_I2S_receiveDataBlocking8(const I2S_Regs *i2s);

/**
 *  @brief      Blocks to ensure receive is ready before reading data
 *
 *  Reads the data from the RX FIFO after blocking to ensure the RX FIFO is not
 *  empty. Will wait indefinitely until there is data in the RX FIFO. See
 *  related APIs for additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 16 bits.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @sa         DL_I2S_receiveData16
 *  @sa         DL_I2S_receiveDataCheck16
 */
uint16_t DL_I2S_receiveDataBlocking16(const I2S_Regs *i2s);

/**
 *  @brief      Blocks to ensure receive is ready before reading data
 *
 *  Reads the data from the RX FIFO after blocking to ensure the RX FIFO is not
 *  empty. Will wait indefinitely until there is data in the RX FIFO. See
 *  related APIs for additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 32 bits.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @sa         DL_I2S_receiveData32
 *  @sa         DL_I2S_receiveDataCheck32
 */
uint32_t DL_I2S_receiveDataBlocking32(const I2S_Regs *i2s);

/**
 *  @brief      Checks the TX FIFO before trying to transmit data
 *
 *  Checks if the TX FIFO is already full before trying to add new data to the
 *  FIFO. Exits immediately if full rather than trying to block. See related
 *  APIs for additional transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 8 bits.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @return     If the transmit occurred
 *
 *  @retval     true  if data was added to the TX FIFO
 *  @retval     false if the TX FIFO was full and data was not added
 *
 *  @sa         DL_I2S_transmitData8
 *  @sa         DL_I2S_transmitDataBlocking8
 */
bool DL_I2S_transmitDataCheck8(I2S_Regs *i2s, uint8_t data);

/**
 *  @brief      Checks the TX FIFO before trying to transmit data
 *
 *  Checks if the TX FIFO is already full before trying to add new data to the
 *  FIFO. Exits immediately if full rather than trying to block. See related
 *  APIs for additional transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 16 bits.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @return     If the transmit occurred
 *
 *  @retval     true  if data was added to the TX FIFO
 *  @retval     false if the TX FIFO was full and data was not added
 *
 *  @sa         DL_I2S_transmitData16
 *  @sa         DL_I2S_transmitDataBlocking16
 */
bool DL_I2S_transmitDataCheck16(I2S_Regs *i2s, uint16_t data);

/**
 *  @brief      Checks the TX FIFO before trying to transmit data
 *
 *  Checks if the TX FIFO is already full before trying to add new data to the
 *  FIFO. Exits immediately if full rather than trying to block. See related
 *  APIs for additional transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 32 bits.
 *
 *  NOTE: A 32-bit write will be written as one FIFO entry. The application can
 *  choose to pack two 16-bit frames into one word.
 *
 *  @param[in]  i2s   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @return     If the transmit occurred
 *
 *  @retval     true  if data was added to the TX FIFO
 *  @retval     false if the TX FIFO was full and data was not added
 *
 *  @sa         DL_I2S_transmitData32
 *  @sa         DL_I2S_transmitDataBlocking32
 */
bool DL_I2S_transmitDataCheck32(I2S_Regs *i2s, uint32_t data);

/**
 *  @brief      Checks the RX FIFO before trying to receive data
 *
 *  Checks if the RX FIFO is already empty before trying to read new data from
 *  the FIFO. Exits immediately if empty rather than trying to block. See
 *  related APIs for additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 8 bits.
 *
 *  @param[in]  i2s    pointer to the register overlay for the peripheral
 *  @param[out]  buffer a buffer to write the received data into
 *
 *  @return     If the receive occurred
 *
 *  @retval     true  if data was read from the RX FIFO
 *  @retval     false if the RX FIFO was empty and data was not read
 *
 *  @sa         DL_I2S_receiveData8
 *  @sa         DL_I2S_receiveDataBlocking8
 */
bool DL_I2S_receiveDataCheck8(const I2S_Regs *i2s, uint8_t *buffer);

/**
 *  @brief      Checks the RX FIFO before trying to receive data
 *
 *  Checks if the RX FIFO is already empty before trying to read new data from
 *  the FIFO. Exits immediately if empty rather than trying to block. See
 *  related APIs for additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 16 bits.
 *
 *  @param[in]  i2s    pointer to the register overlay for the peripheral
 *  @param[out]  buffer a buffer to write the received data into
 *
 *  @return     If the receive occurred
 *
 *  @retval     true  if data was read from the RX FIFO
 *  @retval     false if the RX FIFO was empty and data was not read
 *
 *  @sa         DL_I2S_receiveData16
 *  @sa         DL_I2S_receiveDataBlocking16
 */
bool DL_I2S_receiveDataCheck16(const I2S_Regs *i2s, uint16_t *buffer);

/**
 *  @brief      Checks the RX FIFO before trying to receive data
 *
 *  Checks if the RX FIFO is already empty before trying to read new data from
 *  the FIFO. Exits immediately if empty rather than trying to block. See
 *  related APIs for additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 32 bits.
 *
 *  @param[in]  i2s    pointer to the register overlay for the peripheral
 *  @param[out]  buffer a buffer to write the received data into
 *
 *  @return     If the receive occurred
 *
 *  @retval     true  if data was read from the RX FIFO
 *  @retval     false if the RX FIFO was empty and data was not read
 *
 *  @sa         DL_I2S_receiveData32
 *  @sa         DL_I2S_receiveDataBlocking32
 */
bool DL_I2S_receiveDataCheck32(const I2S_Regs *i2s, uint32_t *buffer);

/**
 *  @brief       Read all available data out of the RX FIFO using 8 bit access
 *
 *  @param[in]   i2s       Pointer to the register overlay for the peripheral
 *  @param[out]  buffer    Buffer to write received data into
 *  @param[in]   maxCount  Max number of halfwords to read from the RX FIFO
 *
 *  @return      Number of bytes read from the RX FIFO
 */
uint32_t DL_I2S_drainRXFIFO8(
    const I2S_Regs *i2s, uint8_t *buffer, uint32_t maxCount);

/**
 *  @brief       Read all available data out of the RX FIFO using 16 bit access
 *
 *  @param[in]   i2s       Pointer to the register overlay for the peripheral
 *  @param[out]  buffer    Buffer to write received data into
 *  @param[in]   maxCount  Max number of halfwords to read from the RX FIFO
 *
 *  @return      Number of halfwords read from the RX FIFO
 */
uint32_t DL_I2S_drainRXFIFO16(
    const I2S_Regs *i2s, uint16_t *buffer, uint32_t maxCount);

/**
 *  @brief       Read all available data out of the RX FIFO using 32 bit access
 *
 *  NOTE: A 32-bit write will be written as one FIFO entry. The application can
 *  choose to pack two 16-bit frames into one word.
 *
 *  @param[in]   i2s       Pointer to the register overlay for the peripheral
 *  @param[out]  buffer    Buffer to write received data into
 *  @param[in]   maxCount  Max number of words to read from the RX FIFO
 *
 *  @return      Number of words read from the RX FIFO
 */
uint32_t DL_I2S_drainRXFIFO32(
    const I2S_Regs *i2s, uint32_t *buffer, uint32_t maxCount);

/**
 *  @brief      Fill the TX FIFO using 8 bit access
 *
 *  Continuously write data into the TX FIFO until it is filled up or count has
 *  been reached.
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Buffer of data to write to the TX FIFO
 *  @param[in]  count   Max number of halfwords to write to the TX FIFO
 *
 *  @return     Number of bytes written to the TX FIFO
 */
uint32_t DL_I2S_fillTXFIFO8(
    I2S_Regs *i2s, const uint8_t *buffer, uint32_t count);

/**
 *  @brief      Fill the TX FIFO using 16 bit access
 *
 *  Continuously write data into the TX FIFO until it is filled up or count has
 *  been reached.
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Buffer of data to write to the TX FIFO
 *  @param[in]  count   Max number of halfwords to write to the TX FIFO
 *
 *  @return     Number of halfwords written to the TX FIFO
 */
uint32_t DL_I2S_fillTXFIFO16(
    I2S_Regs *i2s, const uint16_t *buffer, uint32_t count);

/**
 *  @brief      Fill the TX FIFO using 32 bit access
 *
 *  Continuously write data into the TX FIFO until it is filled up or count has
 *  been reached.
 *
 *  NOTE: A 32-bit write will be written as one FIFO entry. The application can
 *  choose to pack two 16-bit frames into one word.
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Buffer of data to write to the TX FIFO
 *  @param[in]  count   Max number of words to write to the TX FIFO
 *
 *  @return     Number of words written to the TX FIFO
 */
uint32_t DL_I2S_fillTXFIFO32(
    I2S_Regs *i2s, const uint32_t *buffer, uint32_t count);

/**
 *  @brief      Clears contents of TX FIFO
 *
 *  @note When a FIFO clear has been initiated, do not try to re-clear again.
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 */
void DL_I2S_clearTXFIFO(I2S_Regs *i2s);

/**
 *  @brief      Clears contents of RX FIFO
 *
 *  @note When a FIFO clear has been initiated, do not try to re-clear again.
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 */
void DL_I2S_clearRXFIFO(I2S_Regs *i2s);

/**
 *  @brief      Checks if TX FIFO is full
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     If TX FIFO is full
 *
 *  @retval     true if TX FIFO is full
 *  @retval     false if TX FIFO is not full
 */
__STATIC_INLINE bool DL_I2S_isTXFIFOFull(const I2S_Regs *i2s)
{
    return ((i2s->STAT & I2S_STAT_TXFF_MASK) == I2S_STAT_TXFF_SET);
}

