neon-smart-studio/W-Link_NeonRTOS_Platform/src/Drivers/soc/MSPM0/driverlib/dl_i2s.h
/**
 *  @brief      Checks if TX FIFO is empty
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     If TX FIFO is empty
 *
 *  @retval     true if TX FIFO is empty
 *  @retval     false if TX FIFO is not empty
 */
__STATIC_INLINE bool DL_I2S_isTXFIFOEmpty(const I2S_Regs *i2s)
{
    return ((i2s->STAT & I2S_STAT_TXFE_MASK) == I2S_STAT_TXFE_SET);
}

/**
 *  @brief      Checks if RX FIFO is full
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     If RX FIFO is full
 *
 *  @retval     true if RX FIFO is full
 *  @retval     false if RX FIFO is not full
 */
__STATIC_INLINE bool DL_I2S_isRXFIFOFull(const I2S_Regs *i2s)
{
    return ((i2s->STAT & I2S_STAT_RXFF_MASK) == I2S_STAT_RXFF_SET);
}

/**
 *  @brief      Checks if RX FIFO is empty
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     If RX FIFO is empty
 *
 *  @retval     true if RX FIFO is empty
 *  @retval     false if RX FIFO is not empty
 */
__STATIC_INLINE bool DL_I2S_isRXFIFOEmpty(const I2S_Regs *i2s)
{
    return ((i2s->STAT & I2S_STAT_RXFE_MASK) == I2S_STAT_RXFE_SET);
}

/**
 * @brief Enables the Peripheral Write Enable (PWREN) register for the I2S
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2S_enablePower(I2S_Regs *i2s)
{
    i2s->GPRCM.PWREN = (I2S_PWREN_KEY_UNLOCK_W | I2S_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables the Peripheral Write Enable (PWREN) register for the I2S
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @note This API does not provide large power savings. For power savings,
 *  please refer to @ref DL_I2S_enable
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2S_disablePower(I2S_Regs *i2s)
{
    i2s->GPRCM.PWREN = (I2S_PWREN_KEY_UNLOCK_W | I2S_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if the Peripheral Write Enable (PWREN) register for the I2S
 *        is enabled
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     Whether power is enabled
 *
 *  @retval     true if peripheral register access is enabled
 *  @retval     false if peripheral register access is disabled
 */
__STATIC_INLINE bool DL_I2S_isPowerEnabled(const I2S_Regs *i2s)
{
    return (
        (i2s->GPRCM.PWREN & I2S_PWREN_ENABLE_MASK) == I2S_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Resets I2S peripheral
 *
 * @param i2s        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2S_reset(I2S_Regs *i2s)
{
    i2s->GPRCM.RSTCTL =
        (I2S_RSTCTL_KEY_UNLOCK_W | I2S_RSTCTL_RESETSTKYCLR_CLR |
            I2S_RSTCTL_RESETASSERT_ASSERT);
}

/**
 * @brief Returns if I2S peripheral was reset
 *
 * @param i2s        Pointer to the register overlay for the peripheral
 *
 *  @return     Whether module was reset
 *
 *  @retval     true if module was reset
 *  @retval     false if module wasn't reset
 */
__STATIC_INLINE bool DL_I2S_isReset(const I2S_Regs *i2s)
{
    return ((i2s->GPRCM.STAT & I2S_GPRCM_STAT_RESETSTKY_MASK) ==
            I2S_GPRCM_STAT_RESETSTKY_RESET);
}

/**
 *  @brief      Enable the I2S peripheral
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2S_enable(I2S_Regs *i2s)
{
    i2s->FMTCFG |= I2S_FMTCFG_ENABLE_ENABLE;
}

/**
 *  @brief      Disable the I2S peripheral
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2S_disable(I2S_Regs *i2s)
{
    i2s->FMTCFG &= ~(I2S_FMTCFG_ENABLE_MASK);
}

/**
 *  @brief      Checks if the I2S peripheral is enabled
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the enabled status of the I2S
 *
 *  @retval     true  The I2S peripheral is enabled
 *  @retval     false The I2S peripheral is disabled
 */
__STATIC_INLINE bool DL_I2S_isEnabled(const I2S_Regs *i2s)
{
    return (
        (i2s->FMTCFG & I2S_FMTCFG_ENABLE_MASK) == I2S_FMTCFG_ENABLE_ENABLE);
}

/**
 *  @brief      Enable free run control
 *
 *  When enabled, the module will continue to free run and ignores the state
 *  of the CPU halted debug state
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2S_enableFreeRun(I2S_Regs *i2s)
{
    DL_Common_updateReg(
        &i2s->PDBGCTL, I2S_PDBGCTL_FREE_RUN, I2S_PDBGCTL_FREE_MASK);
}

/**
 *  @brief      Disable free run control
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2S_disableFreeRun(I2S_Regs *i2s)
{
    DL_Common_updateReg(
        &i2s->PDBGCTL, I2S_PDBGCTL_FREE_STOP, I2S_PDBGCTL_FREE_MASK);
}

/**
 *  @brief      Returns if free run control is enabled
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 *
 *  @return     Whether free run is enabled
 *
 *  @retval     true if free run is enabled
 *  @retval     false if free run is disabled
 */
__STATIC_INLINE bool DL_I2S_isFreeRunEnabled(const I2S_Regs *i2s)
{
    return ((i2s->PDBGCTL & I2S_PDBGCTL_FREE_MASK) == I2S_PDBGCTL_FREE_RUN);
}

/**
 *  @brief      Get the current mode for the I2S (controller/target)
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     The currently configured mode for I2S (controller/target)
 *
 *  @retval     One of @ref DL_I2S_MODE
 */
DL_I2S_MODE DL_I2S_getMode(const I2S_Regs *i2s);

/**
 *  @brief      Set whether the device should be in controller/target mode
 *
 *  @param[in]  i2s   Pointer to the register overlay for the peripheral
 *  @param[in]  mode  Mode to configure the I2S into. One of @ref DL_I2S_MODE
 *
 *  @sa DL_I2S_init
 */
void DL_I2S_setMode(I2S_Regs *i2s, DL_I2S_MODE mode);

/**
 *  @brief      Enable WCLK and BCLK generation
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2S_enableWBCLKGeneration(I2S_Regs *i2s)
{
    i2s->CLKCTL |= I2S_CLKCTL_WBEN_EN;
}

/**
 *  @brief      Disable WCLK and BCLK generation
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2S_disableWBCLKGeneration(I2S_Regs *i2s)
{
    i2s->CLKCTL &= ~(I2S_CLKCTL_WBEN_MASK);
}

/**
 *  @brief      Returns if WCLK and BCLK generation is enabled
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 *
 *  @return     Whether clock generation is enabled
 *
 *  @retval     true if clock generation is enabled
 *  @retval     false if clock generation is disabled
 *
 */
__STATIC_INLINE bool DL_I2S_isWBCLKGenerationEnabled(const I2S_Regs *i2s)
{
    return ((i2s->CLKCTL & I2S_CLKCTL_WBEN_MASK) == I2S_CLKCTL_WBEN_EN);
}

/**
 *  @brief Enable MCLK generation
 *
 *  MCLK only applies when I2S is operating in controller mode. MCLK is an
 *  optional clock output signal
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 *
 *  @sa DL_I2S_init
 *  @sa DL_I2S_setMode
 */
__STATIC_INLINE void DL_I2S_enableMCLKGeneration(I2S_Regs *i2s)
{
    i2s->CLKCTL |= I2S_CLKCTL_MEN_EN;
}

/**
 *  @brief      Disable MCLK generation
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2S_disableMCLKGeneration(I2S_Regs *i2s)
{
    i2s->CLKCTL &= ~(I2S_CLKCTL_MEN_MASK);
}

/**
 *  @brief      Returns if MCLK generation is enabled
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 *
 *  @return     Whether clock generation is enabled
 *
 *  @retval     true if clock generation is enabled
 *  @retval     false if clock generation is disabled
 */
__STATIC_INLINE bool DL_I2S_isMCLKGenerationEnabled(const I2S_Regs *i2s)
{
    return ((i2s->CLKCTL & I2S_CLKCTL_MEN_MASK) == I2S_CLKCTL_MEN_EN);
}

/**
 *  @brief      Get source of WCLK and BCLK
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     Source of WCLK and BCLK
 *
 *  @retval     One of @ref DL_I2S_WORD_BAUD_CLOCK_SOURCE
 */
__STATIC_INLINE DL_I2S_WORD_BAUD_CLOCK_SOURCE DL_I2S_getWBCLKSource(
    const I2S_Regs *i2s)
{
    uint32_t clockSource = i2s->WCLKSRC & I2S_WCLKSRC_WBCLKSRC_MASK;

    return (DL_I2S_WORD_BAUD_CLOCK_SOURCE)(clockSource);
}

/**
 *  @brief      Set source of WCLK and BCLK
 *
 *  @param[in]  i2s         Pointer to the register overlay for the peripheral
 *
 *  @param[in]  clockSource Source of WCLK and BCLK.
 *                          One of @ref DL_I2S_WORD_BAUD_CLOCK_SOURCE.
 */
__STATIC_INLINE void DL_I2S_setWBCLKSource(
    I2S_Regs *i2s, DL_I2S_WORD_BAUD_CLOCK_SOURCE clockSource)
{
    DL_Common_updateReg(
        &i2s->WCLKSRC, (uint32_t) clockSource, I2S_WCLKSRC_WBCLKSRC_MASK);
}

/**
 *  @brief      Get WCLK inversion status
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     WCLK inversion status
 *
 *  @retval     One of @ref DL_I2S_WCLK_INVERSION
 */
__STATIC_INLINE DL_I2S_WCLK_INVERSION DL_I2S_getWCLKInversion(
    const I2S_Regs *i2s)
{
    uint32_t wclkInversion = i2s->WCLKSRC & I2S_WCLKSRC_WCLKINV_MASK;

    return (DL_I2S_WCLK_INVERSION)(wclkInversion);
}

/**
 *  @brief      Invert WCLK
 *
 *  @param[in]  i2s           Pointer to the register overlay for the peripheral
 *
 *  @param[in]  wclkInversion WCLK inversion status.
 *                            One of @ref DL_I2S_WCLK_INVERSION.
 */
__STATIC_INLINE void DL_I2S_setWCLKInversion(
    I2S_Regs *i2s, DL_I2S_WCLK_INVERSION wclkInversion)
{
    DL_Common_updateReg(
        &i2s->WCLKSRC, (uint32_t) wclkInversion, I2S_WCLKSRC_WCLKINV_MASK);
}

/**
 *  @brief      Get WCLK phase
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     WCLK phase
 *
 *  @retval     One of @ref DL_I2S_WCLK_PHASE
 */
__STATIC_INLINE DL_I2S_WCLK_PHASE DL_I2S_getWCLKPhase(const I2S_Regs *i2s)
{
    uint32_t wclkPhase = i2s->CLKCTL & I2S_CLKCTL_WCLKPHASE_MASK;

